output/books/index.org
#+BEGIN_COMMENT
.. title: Books
.. slug: books
.. date: 2020-09-30 21:42:32 UTC+02:00
.. tags: 
.. category: 
.. link:  
.. description: 
.. type: text

#+END_COMMENT


Here is a list of technical books that I find useful or like in
particular.

* Maths
  :PROPERTIES:
  :CUSTOM_ID: maths
  :END:

** General maths books
   :PROPERTIES:
   :CUSTOM_ID: general-maths-books
   :END:

- Alexander, A: Infinitesimal: How a Dangerous Mathematical Theory
  Shaped the Modern World
- Borrelli, Rullière:
  [[http://math.univ-lyon1.fr/~borrelli/Kakeya.html][En cheminant avec
  Kakeya]] on [[https://en.wikipedia.org/wiki/Kakeya_set][Kakeya's
  needle problem]].
- Bressoud, D.M.: A Radical Approach to Lebesgue's Theory of Integration
- Bressoud, D.M.: A Radical Approach to Real Analysis
- Bressoud, D.M.: Second Year Calculus: from Celestial Mechanics to
  Special Relativity
- Courant, R: What is mathematics
- Dunham, W., Euler the master of us all
- Dunham, W., The calculus galery
- Jeevanjee, N, An introduction to tensors & group theory
- Korner, T: Fourier theory
- Needham T: Visual complex analysis
- Peitgen et al, Chaos
- Vilenkin N.Ya, In search of infinity.

** Markov theory
   :PROPERTIES:
   :CUSTOM_ID: markov-theory
   :END:

These are some great (and sometime intuitive) books to Markov chains,
martingales and optimal stopping.

- Benaïm M. and El Karoui N: Promenade aléatoire: Chaînes de Markov et
  simulations : martingales et stratégie
- Dynkin E.B. and Yushkevich A.A: Markov processes: theorems and
  problems
- Laurie Snell J. and Doyle P.:
  [[https://math.dartmouth.edu/~doyle/][Random walks and electric
  networks]]
- Kemeny and Laurie Snell: Finite Markov Chains.
- Norris J: Markov chains
- [[https://arxiv.org/abs/1209.3632][Baez J.C. and Biamonte J: Quantum
  Techniques for Stochastic Mechanics]]
- Stachurski J: [[https://johnstachurski.net/edtc][Economic Dynamics:
  Theory and Computation]]

** Physics
   :PROPERTIES:
   :CUSTOM_ID: physics
   :END:

- Gourgoulhon E., Relativite restreint des particules a l'astrophysique.
  A good book to prepare yourself for general relativity. It covers all
  I learned as a student on special relativity, and more.
- Zee A.: Einstein Gravity in a Nutshell
- Flanders H.: Differential forms with applications to the physical
  sciences
- Nahin, P.J.: Hot Molecules, Cold Electrons: From the Mathematics of
  Heat to the Development of the Trans-Atlantic Telegraph (2020) (It is
  a petty that Nahin appears not to have read the book of Korner on
  Fourier theory. There is a lot of overlap, and I like Korner' account
  better.)
- Nahin, P.J.: In Praise of Simple Physics: The Science and Mathematics
  behind Everyday Questions

** Probability

- Lindley, D.V.: Understanding Uncertainty, A really nice book to help
  how to think about probability.
- [[https://www.cambridge.org/gb/academic/subjects/physics/theoretical-physics-and-mathematical-physics/probability-theory-logic-science][Jaynes E.T]] Probability theory: the logic of science. I like his opinionated writing a lot. It's funny at times, but often very to the point. 
- Diaconis, P and Skyrms, B: Ten Great Ideas about Chance, Also an
  interesting book that discusses general probability concepts.
- [[https://math.dartmouth.edu/~prob/prob/prob.pdf][Grinstead and Laurie
  snell, introduction to probability]].
- Capinski M., Tomasz Jerzy Zastawniak: Probability Through Problems.
  Targeted at students that like to learn a bit of measure theory.
- Ash, R. B., Real analysis and probability, if you like something
  tougher.

** Queueing theory
   :PROPERTIES:
   :CUSTOM_ID: queueing-theory
   :END:

- Van Foreest, N.D.,
  [[https://github.com/ndvanforeest/queueing_book][Analysis of Queueing
  Systems with Sample Paths and Simulation]], which is free, constains
  lots of problems and solutions.
- Tijms, H.C: A First Course in Stochastic Models, Wiley, 2003.

* Computers
  :PROPERTIES:
  :CUSTOM_ID: computers
  :END:

- Chassell, R.J.: An introduction to Programming in Emacs Lisp

** Algorithms
   :PROPERTIES:
   :CUSTOM_ID: algorithms
   :END:

- Cormen, T.H. et al: Introduction to Algorithms
- Hetland, M.L.: Python Algorithms, Mastering Basic Algorithms in the
  Python Language
- Kopec, D.: Classic Computer Science Problems in Python

** Think books
   :PROPERTIES:
   :CUSTOM_ID: think-books
   :END:

Here are some books freely available for
[[http://greenteapress.com/wp/][download]]. I encourage you to browse
through all of these books. The reason I recommend these books is that
they combine three enormously important skills for students with a
penchant for quantitative work: 1. Making and adapting (mathematical)
models; 1. Analyzing (quantitatively) the models with computers; 1.
Evaluating and interpreting the results.

The books are: 
- Think Stats 
- Probability and statistics for programmers 
- Think Bayes 
- Modeling and Simulation in Python 
- Think Complexity. 
- How to think like a computer scientist 



* General
  :PROPERTIES:
  :CUSTOM_ID: general
  :END:

** Operations management
   :PROPERTIES:
   :CUSTOM_ID: operations-management
   :END:

- Goldratt, E.M.: The goal
- Womack, J.P. and Jones, D.T.: The Machine That Changed the World: The
  Story of Lean Production-- Toyota's Secret Weapon in the Global Car
  Wars That Is Now Revolutionizing World Industr
