output/books/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Books | Nicky's site</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../rss.xml">
<link rel="canonical" href="https://ndvanforeest.github.io/books/">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css">
<link rel="stylesheet" href="https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css">
<meta name="author" content="Nicky van Foreest">
<meta property="og:site_name" content="Nicky's site">
<meta property="og:title" content="Books">
<meta property="og:url" content="https://ndvanforeest.github.io/books/">
<meta property="og:description" content="Here is a list of technical books that I find useful or like in
particular.



Maths




General maths books


Alexander, A: Infinitesimal: How a Dangerous Mathematical Theory
Shaped the Modern World
">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-09-30T21:42:32+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-expand-md static-top mb-4
navbar-dark bg-dark
"><div class="container">
<!-- This keeps the margins nice -->
        <a class="navbar-brand" href="../">

            <span id="blog-title">Nicky's site</span>
        </a>
        <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
        </button>

        <div class="collapse navbar-collapse" id="bs-navbar">
            <ul class="navbar-nav mr-auto">
<li class="nav-item">
<a href="../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../bio/" class="nav-link">Bio</a>
                </li>
<li class="nav-item active">
<a href="." class="nav-link">Books <span class="sr-only">(active)</span></a>
                </li>
<li class="nav-item">
<a href="../sites/" class="nav-link">Sites</a>
                </li>
<li class="nav-item">
<a href="../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../tools/" class="nav-link">Tools</a>

                
            </li>
</ul>
<ul class="navbar-nav navbar-right">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Books</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Here is a list of technical books that I find useful or like in
particular.
</p>

<div id="outline-container-org96c0ee6" class="outline-2">
<h2 id="maths">
<a id="org96c0ee6"></a>Maths</h2>
<div class="outline-text-2" id="text-maths">
</div>

<div id="outline-container-org0269b45" class="outline-3">
<h3 id="general-maths-books">
<a id="org0269b45"></a>General maths books</h3>
<div class="outline-text-3" id="text-general-maths-books">
<ul class="org-ul">
<li>Alexander, A: Infinitesimal: How a Dangerous Mathematical Theory
Shaped the Modern World</li>
<li>Borrelli, Rullière:
<a href="http://math.univ-lyon1.fr/~borrelli/Kakeya.html">En cheminant avec
Kakeya</a> on <a href="https://en.wikipedia.org/wiki/Kakeya_set">Kakeya's
needle problem</a>.</li>
<li>Bressoud, D.M.: A Radical Approach to Lebesgue's Theory of Integration</li>
<li>Bressoud, D.M.: A Radical Approach to Real Analysis</li>
<li>Bressoud, D.M.: Second Year Calculus: from Celestial Mechanics to
Special Relativity</li>
<li>Courant, R: What is mathematics</li>
<li>Dunham, W., Euler the master of us all</li>
<li>Dunham, W., The calculus galery</li>
<li>Jeevanjee, N, An introduction to tensors &amp; group theory</li>
<li>Korner, T: Fourier theory</li>
<li>Needham T: Visual complex analysis</li>
<li>Peitgen et al, Chaos</li>
<li>Vilenkin N.Ya, In search of infinity.</li>
</ul>
</div>
</div>

<div id="outline-container-org966b971" class="outline-3">
<h3 id="markov-theory">
<a id="org966b971"></a>Markov theory</h3>
<div class="outline-text-3" id="text-markov-theory">
<p>
These are some great (and sometime intuitive) books to Markov chains,
martingales and optimal stopping.
</p>

<ul class="org-ul">
<li>Benaïm M. and El Karoui N: Promenade aléatoire: Chaînes de Markov et
simulations : martingales et stratégie</li>
<li>Dynkin E.B. and Yushkevich A.A: Markov processes: theorems and
problems</li>
<li>Laurie Snell J. and Doyle P.:
<a href="https://math.dartmouth.edu/~doyle/">Random walks and electric
networks</a>
</li>
<li>Kemeny and Laurie Snell: Finite Markov Chains.</li>
<li>Norris J: Markov chains</li>
<li><a href="https://arxiv.org/abs/1209.3632">Baez J.C. and Biamonte J: Quantum
Techniques for Stochastic Mechanics</a></li>
<li>Stachurski J: <a href="https://johnstachurski.net/edtc">Economic Dynamics:
Theory and Computation</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-org93fc028" class="outline-3">
<h3 id="physics">
<a id="org93fc028"></a>Physics</h3>
<div class="outline-text-3" id="text-physics">
<ul class="org-ul">
<li>Gourgoulhon E., Relativite restreint des particules a l'astrophysique.
A good book to prepare yourself for general relativity. It covers all
I learned as a student on special relativity, and more.</li>
<li>Zee A.: Einstein Gravity in a Nutshell</li>
<li>Flanders H.: Differential forms with applications to the physical
sciences</li>
<li>Nahin, P.J.: Hot Molecules, Cold Electrons: From the Mathematics of
Heat to the Development of the Trans-Atlantic Telegraph (2020) (It is
a petty that Nahin appears not to have read the book of Korner on
Fourier theory. There is a lot of overlap, and I like Korner' account
better.)</li>
<li>Nahin, P.J.: In Praise of Simple Physics: The Science and Mathematics
behind Everyday Questions</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7c7c57" class="outline-3">
<h3 id="orgf7c7c57">Probability</h3>
<div class="outline-text-3" id="text-orgf7c7c57">
<ul class="org-ul">
<li>Lindley, D.V.: Understanding Uncertainty, A really nice book to help
how to think about probability.</li>
<li>
<a href="https://www.cambridge.org/gb/academic/subjects/physics/theoretical-physics-and-mathematical-physics/probability-theory-logic-science">Jaynes E.T</a> Probability theory: the logic of science. I like his opinionated writing a lot. It's funny at times, but often very to the point.</li>
<li>Diaconis, P and Skyrms, B: Ten Great Ideas about Chance, Also an
interesting book that discusses general probability concepts.</li>
<li>
<a href="https://math.dartmouth.edu/~prob/prob/prob.pdf">Grinstead and Laurie
snell, introduction to probability</a>.</li>
<li>Capinski M., Tomasz Jerzy Zastawniak: Probability Through Problems.
Targeted at students that like to learn a bit of measure theory.</li>
<li>Ash, R. B., Real analysis and probability, if you like something
tougher.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbe535a4" class="outline-3">
<h3 id="queueing-theory">
<a id="orgbe535a4"></a>Queueing theory</h3>
<div class="outline-text-3" id="text-queueing-theory">
<ul class="org-ul">
<li>Van Foreest, N.D.,
<a href="https://github.com/ndvanforeest/queueing_book">Analysis of Queueing
Systems with Sample Paths and Simulation</a>, which is free, constains
lots of problems and solutions.</li>
<li>Tijms, H.C: A First Course in Stochastic Models, Wiley, 2003.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org42bc8f6" class="outline-2">
<h2 id="computers">
<a id="org42bc8f6"></a>Computers</h2>
<div class="outline-text-2" id="text-computers">
<ul class="org-ul">
<li>Chassell, R.J.: An introduction to Programming in Emacs Lisp</li>
</ul>
</div>

<div id="outline-container-org7356836" class="outline-3">
<h3 id="algorithms">
<a id="org7356836"></a>Algorithms</h3>
<div class="outline-text-3" id="text-algorithms">
<ul class="org-ul">
<li>Cormen, T.H. et al: Introduction to Algorithms</li>
<li>Hetland, M.L.: Python Algorithms, Mastering Basic Algorithms in the
Python Language</li>
<li>Kopec, D.: Classic Computer Science Problems in Python</li>
</ul>
</div>
</div>

<div id="outline-container-org962f908" class="outline-3">
<h3 id="think-books">
<a id="org962f908"></a>Think books</h3>
<div class="outline-text-3" id="text-think-books">
<p>
Here are some books freely available for
<a href="http://greenteapress.com/wp/">download</a>. I encourage you to browse
through all of these books. The reason I recommend these books is that
they combine three enormously important skills for students with a
penchant for quantitative work: 1. Making and adapting (mathematical)
models; 1. Analyzing (quantitatively) the models with computers; 1.
Evaluating and interpreting the results.
</p>

<p>
The books are: 
</p>
<ul class="org-ul">
<li>Think Stats</li>
<li>Probability and statistics for programmers</li>
<li>Think Bayes</li>
<li>Modeling and Simulation in Python</li>
<li>Think Complexity.</li>
<li>How to think like a computer scientist</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org481dd20" class="outline-2">
<h2 id="general">
<a id="org481dd20"></a>General</h2>
<div class="outline-text-2" id="text-general">
</div>

<div id="outline-container-org9001cc5" class="outline-3">
<h3 id="operations-management">
<a id="org9001cc5"></a>Operations management</h3>
<div class="outline-text-3" id="text-operations-management">
<ul class="org-ul">
<li>Goldratt, E.M.: The goal</li>
<li>Womack, J.P. and Jones, D.T.: The Machine That Changed the World: The
Story of Lean Production– Toyota's Secret Weapon in the Global Car
Wars That Is Now Revolutionizing World Industr</li>
</ul>
</div>
</div>
</div>
    </div>
    

</article><!--End of body content--><footer id="footer"><div class="text-center">
<p>
<span class="fa-stack">
  <a href="https://github.com/ndvanforeest">
    <i class="fa fa-github-square fa-stack-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="http://scholar.google.com/citations?user=IEjX_w4AAAAJ">
     <i class="ai ai-google-scholar-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="https://orcid.org/0000-0001-5428-1723">
     <i class="ai ai-orcid-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="https://www.linkedin.com/in/nicky-van-foreest-22b9637">
    <i class="fa fa-square fa-stack-2x"></i>
    <i class="fa fa-linkedin fa-inverse fa-stack-1x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="mailto:vanforeest@gmail.com">
    <i class="fa fa-square fa-stack-2x"></i>
    <i class="fa fa-envelope fa-inverse fa-stack-1x"></i>
  </a>
</span>
</p>
<p>
  Contents © 2020  Nicky van Foreest
  —
  
  —
  Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a>
</p>
</div>

            
            
        </footer>
</div>
</div>


        <script src="../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
